---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures.SimpleConnectionTooFarRefs
source: html/e7898cf6-8e70-9bd3-b12a-d888e0cc6b43.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures.SimpleConnectionTooFarRefs Property

Simple Structural Connection Handler cannot connect too far elements

## Syntax (C#)
```csharp
public static FailureDefinitionId SimpleConnectionTooFarRefs { get; }
```